---
title: "2022 회고"
subtitle: ""
date: 2023-02-01
description:
  - ""
image: images/retrospect-2022/2022.jpg
meta_image: static/images/retrospect-2022/2022.jpg
tags:
  - 2022 회고
categories:
  - 회고
---

## 들어가며

---

&nbsp;&nbsp;&nbsp;어느덧 2023년 1달이 지났다. 연초에 위염+장염이 심하게 걸리는 바람에 회고를 뒤늦게 쓰게 되었다. 개인적으로 2017년 부터 노션에 새해 목표를 정하고 연말에 달성여부를 기록하는 정도로만 매년 회고를 했었지만, 이렇게 글로 쓰는건 처음이다. 어색하지만 회사 동료분들이 작성하는 것을 보고, 단순히 나열만 하는 목표보다 기억에도 많이 남고 자극이 될 것 같아서 작성하게 되었다.

## 1. 새로운 회사, 그리고 적응

---

&nbsp;&nbsp;&nbsp;2021년 11월에 1인 개발하던 회사에서 퇴사하고 충분히 쉬기로 마음 먹었다. 오랫동안 쉼없이 일해오기도 했고 1인 개발을 하면서 번아웃이 오면서, 나를 위해 그리고 새로 입사하게 될 회사를 위해 쉬는것이 좋다고 생각했기 때문이다. 제주도에 한달 가까이 있으면서 올레길도 걷고, 장롱면허 탈출을 위해 매일매일 차를 끌고 새로운 곳을 돌아다녔다. 아마 취업 이후로 가장 긴 기간(5개월 가량?)을 쉬었던 것 같다.
{{< img src="/images/retrospect-2022/jeju-olle.jpg" title="제주도" caption="올레길" position="center" width="300px" >}}
&nbsp;&nbsp;&nbsp;그렇게 에너지를 충전 하고 3월에 새로운 핀테크 스타트업 회사에 입사하게 되었다. 초기 멤버분들이 퇴사하고 투자를 받으면서 새로운 분들과 팀이 구성되었다. 에너지 넘치는 분들과 함께 하니 지금까지 재밌게 일해오고 있다. 내가 처음 입사 했을때보다 많은 부분이 개선되었고 지금도 계속 개선해 나가고 있다. 회사도 작년에 pre A로 120억 정도 투자를 받았고 현재 빠르게 성장해 나가고 있다. 올해 series A 투자를 받도록 많은 기여를 하는게 하나의 목표이다

## 2. AI 부트캠프

---

&nbsp;&nbsp;&nbsp;현재 파이썬으로 백엔드를 개발하고 있지만, 파이썬이 가장 많이 활용되는 데이터 분석이나 인공지능 분야에 대해서는 무지했고, 흥미로운 주제정도로만 인식을 가지고 있었다. 그래서 4월부터 14주 동안 ‘쏘카 실전데이터로 배우는 AI 엔지니어 육성 부트 캠프 2기’에 참가하여 AI 교육을 들었다. 강의는 8주동안 이론수업이 온라인으로 진행되었고 총 세개의 과제가 있었다. 이론수업이 끝나고 팀을짜서 6주동안 해커톤을 진행하였다. 가벼운 마음으로 들어왔다가 생각보다 높은 난이도와 빡빡한 일정에 꽤나 고생했던 것 같다. 그래도 80명이 넘는 부트캠프 인원중에 11등을 하면서 과정을 마무리 하였다. (10등부터 시상을 하는데 아쉽…)

&nbsp;&nbsp;&nbsp;부트캠프 과정을 진행하면서 AI가 이미 생활속에서 많이 활용되고 있고 앞으로 더 많은 분야에서 활용될 것이라 느꼈는데, 반년정도가 지난 지금 ChatGPT가 나오면서 AI 광풍이라고 느껴질정도로 매일같이 AI 뉴스가 쏟아지고 있다. 작년에는 하지 못했지만, 올해는 AI를 활용한 토이 프로젝트를 진행해 보는것이 목표이다.

## 3. 개인적인 성장과 아쉬운 점

---

&nbsp;&nbsp;&nbsp;새로운 회사에 입사하게 되면서, 개인적으로 가장 좋았던 점은 TDD를 중요시 한다는 점이었다. 1인 개발을 할때 TDD를 도입해본적이 있었지만, 필요성을 많이 느끼지는 못하였다. 하지만 실제 운영되고 있는 서비스에서 TDD를 경험하고 나니, 테스트 코드가 주는 심리적 안정감 때문에 언제든 리팩토링을 할 수 있었고, 요구 사항에 맞는 기능을 개발하는데 큰 도움이 되었다. 입사했을때 300개 였던 테스트가 어느덧 1,000개 가까이 되가는 것을 보면 새삼 놀랍다.

&nbsp;&nbsp;&nbsp;그리고 많은 팀원이 있는 것은 아니지만, 어느덧 연차가 쌓이다 보니 회사에서 팀장님 다음으로 연차가 많은 개발자가 되었다. 팀장님을 잘 서포트하는 것은 물론이고 주니어 개발자 분들에게 도움이 되는 개발자가 되고 싶었다. 입사하고 가장 먼저 한일은, 개발 스타일 가이드를 만든 것이다. 핀테크다 보니 비즈니스 로직이 꽤나 복잡한데, 이런것들이 규칙없이 개발 되어서 로직들이 파편화 되어있었다. 그래서 스타일 가이드를 만들고 이를 기반으로 코드리뷰를 시작하였고 지금은 자연스러운 문화로 정착되었다. 단순히 기능을 전달받아 개발을 시작하는게 아니라, 설계부터 코드작성까지 대화를 통해 이야기하고 진행하게 되었다는 점에서 매우 고무적이라고 생각한다. 이 과정에서 나 또한 많은 도움을 받았고 성장하는 것을 느꼈다. 이제 새로운 코드들은 스타일 가이드에 따라 작성되고 있고, 기존 코드들도 계속 리팩토링 되고 있다. 그리고 매주 book study를 하고 지식공유하는 시간 또한 가지고 있다.

&nbsp;&nbsp;&nbsp;하지만 한계점 또한 존재했다. 아무래도 초기 스타트업이라 기술적인 완성도보다 빠른 비즈니스 로직 반영이 더 중요시 된다. 내가 기술적으로 새롭게 시도해보고 싶은것을 회사의 요구사항에 맞추느라 포기해야 했던적이 많았다. 그렇다고 내가 개인적인 시간을 투자해서 성장을 위해 노력 했는가?라고 물어보면 그렇지도 않았던 거 같다. 올해는 조금씩이라도 기술적 성장을 위한 개인적인 시간을 늘려가야 겠다.

## 4. 출퇴근 시간 활용

---

&nbsp;&nbsp;&nbsp;출퇴근 시간에 보통 핸드폰 게임을 하거나 영상 시청을 하면서 시간을 때우는 경우가 많았는데 2022년에 하반기 부터는 책을 한권 가지고 다니면서 읽기 시작했다. 생각보다 잘 읽히고 꽤나 읽은 책수가 많아졌다. 그리고 '커리어리'라는 앱을 보기 시작했다. 실제 현업 개발자, 마케터, 데이터 엔지니어등 다양한 분야의 사람들의 양질의 컨텐츠를 볼 수 있어 출퇴근 시간에 매우 유용하게 활용하고 있다.
아래는 출퇴근 길에 읽은 도서 list 이다.

- 데이터 모델링 이야기
- 클린코드
- 파이썬 디자인 패턴
- 가상 면접 사례로 배우는 대규모 시스템 설계 기초
- 역행자
- 클루지
- 언스크립티드 - 부의 추월차선
- 닥치는대로 끌리는대로 - 이동진
- 나는 회사다니면서 창업하기로 했다
- 구글 엔지니어는 이렇게 일한다

## 5. 결혼

---

&nbsp;&nbsp;&nbsp;작년말부터 4년 넘게 사귄 여자친구와 결혼하기로 얘기를 하였다. 서로 결혼식은 원하지 않아서 각자 부모님들과 합의 후 결혼식없이 하기로 하였다. 결혼식을 안하기 때문에 집부터 보러 다녔는데, 강동구 쪽에 너무 괜찮은 집이 좋은 가격에 올라와 덜컥 계약을 해버렸다. 집을 구하고 그 뒤로 가전, 혼수를 계약하고 상견례까지 일사천리로 진행되고 있다. 이제는 3월 10일 입주와 웨딩사진 찍는것만 남겨두고 있다. 지나고 나니 결혼식까지 할걸 그랬나 하는 마음도 가끔씩 들긴하지만(아무래도 부모님이 아쉬워 하셔서…) 그만큼 잘사는 모습을 보여드려야겠다. 이제 새로운 가족과 살아갈 생각에 설레기도 하지만 그만큼 책임감도 더 생기는 것 같다. 싸우지말고 행복하게 잘 살아보자!!

## 6. 2023 목표

---

&nbsp;&nbsp;&nbsp;2022년을 회고해 보면 새로운 회사에 입사하고 적응하고, 부트캠프도 참여하고, 결혼도 준비하고 바쁜한해였지만 개인적인 성장으로써는 아쉬운 부분이 많았던 것 같다. 그래서 올해 2023의 목표는 크게 아래와 같이 설정하였다. 단순히 회사에만 의존하는 삶만 아니라 개인적으로 나의 삶의 질을 높일 수 있는 목표들을 설정하였고, 이를 위해 daily 목표 또한 설정 하였다.

### 올해 목표

- 체중감소를 위한 유산소 운동
- 유튜브 키우기
- 앱 만들기
- 개발자 역량 강화 - 코딩테스트, 블로그 쓰기
- 독서 10권

### daily 목표

- 코딩테스트(월)
- 블로그 글쓰기(화)
- 런닝(화,목,토)
- 영상편집(목,금)
- 앱 만들기(주말)
  <br>
  {{< img src="/images/retrospect-2022/routine-all.png" title="routine" caption="notion 습관 트래커" position="center" width="750px" >}}
  &nbsp;&nbsp;&nbsp;물론 daily 목표를 매 요일마다 지키기는게 매우 힘들겠지만 적어도 10분만이라도 시간을 투자하고 늘려나갈 생각이다. 조금씩이라도 루틴을 지키다보면 2023년에는 좀 더 많은 것들이 이루어져 있을거 같다.
